; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v4 ?v12)
             (pred_11 ?v9 ?v13)
             (pred_1 ?v4 ?v13)
             (pred_12 ?v8 ?v4 )
	     (pred_5 ?v4)
             (pred_8 ?v10)
             (pred_10 ?v9)
             (pred_2 ?v13)
             (pred_7 ?v4)
             (pred_3 ?v9)
             (pred_9 ?v4)
             (pred_4 ))



(:action op_2
:parameters (?v7 ?v5 ?v11 ?v6)
:precondition (and (pred_8 ?v7) (pred_8 ?v5) (pred_10 ?v11) (pred_2 ?v6)
          (pred_6 ?v7 ?v5) (pred_11 ?v11 ?v6)
                   (pred_1 ?v5 ?v6) (pred_5 ?v7) 
                   (pred_7 ?v5) (pred_3 ?v11))
:effect (and  (pred_9 ?v5) (not (pred_7 ?v5))))


(:action op_1
:parameters (?v7 ?v2)
:precondition (and (pred_8 ?v7) (pred_8 ?v2)
               (pred_5 ?v7) (pred_6 ?v7 ?v2) (pred_9 ?v2))
:effect (and (pred_5 ?v2) (not (pred_5 ?v7))))

(:action op_5
:parameters (?v7 ?v11)
:precondition (and (pred_8 ?v7) (pred_10 ?v11) 
                  (pred_5 ?v7) (pred_12 ?v11 ?v7) (pred_4 ))
:effect (and (pred_3 ?v11)
   (not (pred_12 ?v11 ?v7)) (not (pred_4 ))))


(:action op_3
:parameters (?v7 ?v1 ?v3)
:precondition (and (pred_8 ?v7) (pred_10 ?v1) (pred_10 ?v3)
                  (pred_5 ?v7) (pred_3 ?v3) (pred_12 ?v1 ?v7))
:effect (and (pred_3 ?v1) (pred_12 ?v3 ?v7)
        (not (pred_3 ?v3)) (not (pred_12 ?v1 ?v7))))

(:action op_4
:parameters (?v7 ?v11)
:precondition (and (pred_8 ?v7) (pred_10 ?v11) 
                  (pred_5 ?v7) (pred_3 ?v11))
:effect (and (pred_4 ) (pred_12 ?v11 ?v7) (not (pred_3 ?v11)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_02 obj_17 obj_16 obj_06 obj_08 obj_05 obj_14 obj_18 obj_10 obj_01 obj_09 obj_07 obj_03 obj_11 obj_15 obj_19
    obj_04 obj_20
    obj_12 obj_13
    )

    (:init
       (pred_4)

       (pred_8 obj_02)
       (pred_8 obj_17)
       (pred_8 obj_16)
       (pred_8 obj_06)
       (pred_8 obj_08)
       (pred_8 obj_05)
       (pred_8 obj_14)
       (pred_8 obj_18)
       (pred_8 obj_10)
       (pred_8 obj_01)
       (pred_8 obj_09)
       (pred_8 obj_07)
       (pred_8 obj_03)
       (pred_8 obj_11)
       (pred_8 obj_15)
       (pred_8 obj_19)
       (pred_2 obj_04)
       (pred_2 obj_20)
       (pred_10 obj_12)
       (pred_10 obj_13)

       (pred_6 obj_02 obj_08)
       (pred_6 obj_02 obj_17)
       (pred_6 obj_17 obj_05)
       (pred_6 obj_17 obj_16)
       (pred_6 obj_17 obj_02)
       (pred_6 obj_16 obj_14)
       (pred_6 obj_16 obj_06)
       (pred_6 obj_16 obj_17)
       (pred_6 obj_06 obj_18)
       (pred_6 obj_06 obj_16)
       (pred_6 obj_08 obj_10)
       (pred_6 obj_08 obj_05)
       (pred_6 obj_08 obj_02)
       (pred_6 obj_05 obj_01)
       (pred_6 obj_05 obj_14)
       (pred_6 obj_05 obj_17)
       (pred_6 obj_05 obj_08)
       (pred_6 obj_14 obj_09)
       (pred_6 obj_14 obj_18)
       (pred_6 obj_14 obj_16)
       (pred_6 obj_14 obj_05)
       (pred_6 obj_18 obj_07)
       (pred_6 obj_18 obj_06)
       (pred_6 obj_18 obj_14)
       (pred_6 obj_10 obj_03)
       (pred_6 obj_10 obj_01)
       (pred_6 obj_10 obj_08)
       (pred_6 obj_01 obj_11)
       (pred_6 obj_01 obj_09)
       (pred_6 obj_01 obj_05)
       (pred_6 obj_01 obj_10)
       (pred_6 obj_09 obj_15)
       (pred_6 obj_09 obj_07)
       (pred_6 obj_09 obj_14)
       (pred_6 obj_09 obj_01)
       (pred_6 obj_07 obj_19)
       (pred_6 obj_07 obj_18)
       (pred_6 obj_07 obj_09)
       (pred_6 obj_03 obj_11)
       (pred_6 obj_03 obj_10)
       (pred_6 obj_11 obj_15)
       (pred_6 obj_11 obj_01)
       (pred_6 obj_11 obj_03)
       (pred_6 obj_15 obj_19)
       (pred_6 obj_15 obj_09)
       (pred_6 obj_15 obj_11)
       (pred_6 obj_19 obj_07)
       (pred_6 obj_19 obj_15)
       (pred_7 obj_18)
       (pred_7 obj_07)
       (pred_1  obj_18 obj_04)
       (pred_1  obj_07 obj_20)
       (pred_9 obj_02)
       (pred_9 obj_17)
       (pred_9 obj_16)
       (pred_9 obj_06)
       (pred_9 obj_08)
       (pred_9 obj_05)
       (pred_9 obj_14)
       (pred_9 obj_10)
       (pred_9 obj_01)
       (pred_9 obj_09)
       (pred_9 obj_03)
       (pred_9 obj_11)
       (pred_9 obj_15)
       (pred_9 obj_19)

       (pred_11  obj_12 obj_04)
       (pred_11  obj_13 obj_20)
       (pred_12 obj_12 obj_02)
       (pred_12 obj_13 obj_09)
       (pred_5 obj_08)
    )

    (:goal (and
       (pred_12 obj_12 obj_18)
    ))
(:constraints
  (always (not (pred_5 obj_06)))
)
)

; plan
1. (op_1 obj_08 obj_02)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_02)
   goals met: 0 of 1
2. (op_5 obj_02 obj_12)
   deleted: (pred_12 obj_12 obj_02) (pred_4)
   added: (pred_3 obj_12)
   goals met: 0 of 1
3. (op_1 obj_02 obj_17)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_17)
   goals met: 0 of 1
4. (op_1 obj_17 obj_16)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_16)
   goals met: 0 of 1
5. (op_1 obj_16 obj_14)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_14)
   goals met: 0 of 1
6. (op_2 obj_14 obj_18 obj_12 obj_04)
   deleted: (pred_7 obj_18)
   added: (pred_9 obj_18)
   goals met: 0 of 1
7. (op_1 obj_14 obj_18)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_18)
   goals met: 0 of 1
8. (op_4 obj_18 obj_12)
   deleted: (pred_3 obj_12)
   added: (pred_4) (pred_12 obj_12 obj_18)
   goals met: 1 of 1
